load-testing.yaml
config:
  target: "http://localhost:3000"  # Change to your API base URL
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up - 10 users per second"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up - 50 users per second"
    - duration: 180
      arrivalRate: 100
      name: "Peak load - 100 users per second"
    - duration: 60
      arrivalRate: 10
      name: "Cool down - 10 users per second"
  variables:
    users:
      - name: "Vero Agrisanda"
        username: "veroagrisand1"
        email: "veroagrisanda1@gmail.com"
        password: "password123"
      - name: "John Doe"
        username: "johndoe2"
        email: "johndoe2@gmail.com"
        password: "password123"
      - name: "Jane Smith"
        username: "janesmith3"
        email: "janesmith3@gmail.com"
        password: "password123"
      - name: "Alice Johnson"
        username: "alicejohnson4"
        email: "alice.johnson4@gmail.com"
        password: "password123"
      - name: "Bob Williams"
        username: "bobwilliams5"
        email: "bob.williams5@gmail.com"
        password: "password123"

scenarios:
  - name: "User Registration - Predefined Users"
    weight: 30
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ $randomItem(users).name }}"
            username: "{{ $randomItem(users).username }}_{{ $randomNumber(1000, 9999) }}"
            email: "{{ $randomItem(users).email }}"
            password: "{{ $randomItem(users).password }}"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode:
                - 201
                - 400
                - 409

  - name: "User Registration - Random Users"
    weight: 70
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "User {{ $randomNumber(10000, 99999) }}"
            username: "user{{ $randomNumber(10000, 99999) }}"
            email: "user{{ $randomNumber(10000, 99999) }}@example.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode:
                - 201
                - 400
                - 409
            - contentType: json

  - name: "User Registration - Specific Example"
    weight: 10
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "Vero Agrisanda"
            username: "veroagrisand_{{ $randomNumber(1000, 9999) }}"
            email: "veroagrisanda+{{ $randomNumber(1000, 9999) }}@gmail.com"
            password: "password123"
          expect:
            - statusCode:
                - 201
                - 400
                - 409